_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
Encoder (Model)              (None, 10)                54196     
_________________________________________________________________
Decoder (Model)              (None, 28, 28, 1)         3422261   
=================================================================
Total params: 3,476,457
Trainable params: 3,476,391
Non-trainable params: 66
_________________________________________________________________
Epoch 1/10
